cmsis-svd/cmsis-svd-data/data/Atmel/ATSAMD10D13AS.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <version>2.0.0</version>
      <description>Watchdog Timer</description>
      <groupName>WDT</groupName>
      <prependToName>WDT_</prependToName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WDT</name>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WEN</name>
              <description>Watchdog Timer Window Mode Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALWAYSON</name>
              <description>Always-On</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <resetValue>0xBB</resetValue>
          <fields>
            <field>
              <name>PER</name>
              <description>Time-Out Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PERSelect</name>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 clock cycles</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1K</name>
                  <description>1024 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2K</name>
                  <description>2048 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4K</name>
                  <description>4096 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <description>8192 clock cycles</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16384 clock cycles</description>
                  <value>0xb</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW</name>
              <description>Window Mode Time-Out Period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>WINDOWSelect</name>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 clock cycles</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1K</name>
                  <description>1024 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2K</name>
                  <description>2048 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4K</name>
                  <description>4096 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <description>8192 clock cycles</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16384 clock cycles</description>
                  <value>0xb</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EWCTRL</name>
          <description>Early Warning Interrupt Control</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <resetValue>0x0B</resetValue>
          <fields>
            <field>
              <name>EWOFFSET</name>
              <description>Early Warning Interrupt Time Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EWOFFSETSelect</name>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 clock cycles</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1K</name>
                  <description>1024 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2K</name>
                  <description>2048 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4K</name>
                  <description>4096 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <description>8192 clock cycles</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16384 clock cycles</description>
                  <value>0xb</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EW</name>
              <description>Early Warning Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EW</name>
              <description>Early Warning Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EW</name>
              <description>Early Warning</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SYNCBUSY</name>
              <description>Synchronization Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEAR</name>
          <description>Clear</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Watchdog Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>CLEARSelect</name>
                <enumeratedValue>
                  <name>KEY</name>
                  <description>Clear Key</description>
                  <value>0xa5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
